"appName" = "Inlaider (sk)";


"popup.command.placeholder.typeACommand" = "Zadajte príkaz...";
"popup.command.placeholder.typeACommandOrEnterQuit" = "Zadajte príkaz alebo stlačte Enter na zatvorenie...";
"popup.command.placeholder.typeACommandOrEnterPaste" = "Zadajte príkaz alebo stlačte Enter na vloženie výsledku";
"popup.navigation.focusCanvas.label" = "⌘ ⬆️ — prepína na editor";
"popup.navigation.focusCommandline.label" = "⌘ ⬇️ — prepína na príkazový riadok";
"popup.shortcut.clearCanvas" = "⌘⌫ čistí editor";
"popup.shortcut.copyCanvas" = "⌘C kopíruje obsah editora";
"popup.shortcut.copyCanvasOrEnterCopy" = "⌘C alebo Enter kopíruje obsah editora";
"popup.shortcut.enterPaste" = "Enter vkladá do";
"popup.shortcut.esc" = "Esc zatvára do";

"show" = "Zobraziť";
"about" = "O programe";
"quit" = "Ukončiť";
"close" = "Zatvoriť";
"cancel" = "Zrušiť";
"save" = "Uložiť";
"ok" = "OK";
"settings" = "Nastavenia";
"copied" = "Skopírované";

"settings.section.general.title" = "Všeobecné";
"settings.accessibility.title" = "Prístupové oprávnenia";
"settings.accessibility.description" = "Toto oprávnenie je potrebné na automatické čítanie vybraného textu a vloženie spracovaného výsledku späť do pôvodného textového poľa.\nBez prístupu bude aplikácia používať schránku na prenos údajov.";
"settings.inlaiderShortcut.label" = "Klávesová skratka pre Inlaider";
"settings.LaunchAtLogin.label" = "Spustiť pri štarte";

"settings.section.ownAPIKeys.title" = "Vlastné API kľúče";
"provider.apiKey.title" = "API kľúč";
"provider.apiKey.placeholder" = "Zadajte API kľúč sem";
"provider.models.title" = "Modely";
"provider.models.new.placeholder" = "Pridať názov modelu";

"settings.section.customPrompts.title" = "Náhrady promptov";
"prompts.general.title" = "Všeobecný prompt";
"prompts.replacements.title" = "Náhrady promptov";
"prompts.replacements.replaceWhat.label" = "Nahradiť";
"prompts.replacements.model.label" = "Model";
"prompts.replacements.replaceWith.label" = "Na prompt";
"prompts.replacements.error.exists.message" = "Náhrada príkazu '%@' už existuje.";

"about.ThirdPartyLicenses" = "Licencie tretích strán";
"about.VisitOnGithub" = "Pozrieť na GitHub";
"about.version" = "Verzia %@";

"error.title" = "Chyba";